** Indent Tabs
Don't ever, ever save tabs, and make trailing whitespace visible. Note: The setq-default command sets values only in buffers that do not have their own local values for the variable.

Also, set tabs to two spaces in a lot of modes.
#+BEGIN_SRC emacs-lisp
(debug-msg "indent tabs ...")
(setq-default indent-tabs-mode nil)

(setq-default show-trailing-whitespace t)
;; (defun set-indent (n)
;;   (setq-default
;;    c-basic-offset n
;;    coffee-tab-width n
;;    css-indent-offset n
;;    default-tab-width n
;;    evil-shift-width n
;;    javascript-indent-level n
;;    js2-basic-offset n
;;    js-indent-level n
;;    json-indent-level n
;;    json-tab-width n
;;    prolog-indent-width n
;;    python-indent n
;;    python-indent-offset n
;;    ruby-indent n
;;    ruby-tab-width n
;;    sh-indentation n
;;    standard-indent n
;;    tab-width n
;;    web-mode-attr-indent-offset n
;;    web-mode-code-indent-offset n
;;    web-mode-css-indent-offset n
;;    web-mode-markup-indent-offset n
;;    yaml-indent-offset n
;;    ))

(defun set-tab-width (n)
  (dolist (var '(
                 default-tab-width
                 c-basic-offset
                 cmake-tab-width
                 coffee-tab-width
                 cperl-indent-level
                 css-indent-offset
                 elixir-smie-indent-basic
                 enh-ruby-indent-level
                 erlang-indent-level
                 ess-indent-level
                 evil-shift-width
                 javascript-indent-level
                 js-indent-level
                 js2-basic-offset
                 js3-indent-level
                 json-indent-level
                 lisp-indent-offset
                 livescript-tab-width
                 mustache-basic-offset
                 nxml-child-indent
                 perl-indent-level
                 prolog-indedent-offset
                 puppet-indent-level
                 python-indent-offset
                 ruby-indent
                 ruby-indent-level
                 ruby-tab-width
                 rust-indent-offset
                 scala-indent:step
                 sgml-basic-offset
                 sh-basic-offset
                 sh-indentation
                 tab-width
                 web-mode-attr-indent-offset
                 web-mode-code-indent-offset
                 web-mode-css-indent-offset
                 web-mode-markup-indent-offset
                 yaml-indent-offset n
                 ))
    (set (make-local-variable var) n)))

;; (set-indent 2)
(set-tab-width 2)
(setq js-indent-level 2)
(add-hook 'shell-script-hook (lambda () (set-indent 2)))
#+END_SRC

#+RESULTS:
| lambda | nil | (set-indent 2) |

Use untabify-buffer if someone left tabs in the files
 #+BEGIN_SRC emacs-lisp
(defun untabify-buffer ()
  (interactive)
  (untabify (point-min) (point-max)))

(defun indent-buffer ()
  (interactive)
  (indent-region (point-min) (point-max)))

(defun cleanup-buffer ()
  "Perform a bunch of operations on the whitespace content of a buffer."
  (interactive)
  (indent-buffer)
  (untabify-buffer)
  (delete-trailing-whitespace))

(defun cleanup-region (beg end)
  "Remove tmux artifacts from region."
  (interactive "r")
  (dolist (re '("\\\\│\·*\n" "\W*│\·*"))
    (replace-regexp re "" nil beg end)))

(global-set-key (kbd "C-x M-t") 'cleanup-region)
(global-set-key (kbd "C-c n") 'cleanup-buffer)
#+END_SRC

Turn on line wrap globally.
 #+BEGIN_SRC emacs-lisp
(global-visual-line-mode 1)
#+END_SRC
** Org
#+BEGIN_SRC emacs-lisp
(debug-msg "org ...")
(require 'org)

(setq org-journal-dir "~/drop/notes/journal/")
(setq org-brain-path "~/drop/brain/")
(setq org-attach-directory "~/drop/notes/")
;; (setq-default org-attach-directory "~/drop/notes/")
(setq org-default-notes-file (concat org-directory "1.todo.org"))

(setq org-agenda-files (list
                        ;; "~/Dropbox/docs/org/gtd.org"
                        ;; "~/Dropbox/docs/org/work.org"
                        ;; "~/Dropbox/docs/org/home.org"
                        ;; "~/Dropbox/docs/org/"
                        "~/drop/notes"
                        ))

;; the following needs to be included with other layers in spacemacs file
;; (setq-default dotspacemacs-configuration-layers
;;              '((erc :variables
;;                     erc-server-list
;;                     '(("irc.freenode.net"
;;                        :port "6697"
;;                        :ssl t
;;                        :nick "some-user"
;;                        :password "secret")
;;                       ))))

(setq org-capture-templates
      '(("t" "GTD" entry (file+headline "~/drop/notes/gtd.org" "GTD")
         "* TODO %?\n  %i\n  %a")
        ("w" "Work Journal" entry (file+datetree "~/drop/notes/work-journal.org")
         "* %?")
        ("x" "Work Journal (extended entry)" entry (file+datetree "~/drop/notes/work-journal.org")
         "* %?\nEntered on %U\n  %i\n  %a")
        ("j" "Journal" entry (file+datetree "~/drop/notes/journal.org")
         ;; "* %?\nEntered on %U\n  %i\n  %a")
         "* TODO %?\nEntered on %U")
        ))
  ;; the above uses these escapes
  ;; %a          annotation, normally the link created with org-store-link
  ;; %i          initial content, the region when capture is called with C-u.
  ;; %t, %T      timestamp, date only, or date and time
  ;; %u, %U      like above, but inactive timestamps

  ;; for org mode
  (setq org-bullets-bullet-list '("■" "◆" "▲" "▶"))

  (setq org-todo-keywords
        ;; cone and delegated are completed tasks; the others need further action
    '((sequence "TODO" "FOCUS" "DOING" "|" "DONE" "DELEGATED" "CANCELED")))
    ;; '((sequence "TODO" "FEEDBACK" "VERIFY" "|" "DONE" "DELEGATED" "CANCELED")))

  (setq org-todo-keyword-faces
        '(("TODO" . (:foreground "red" :weight bold))
          ("FEEDBACK" . "yellow")
          ("CANCELED" . (:foreground "blue" :weight bold))
          ))

  ;; (with-eval-after-load
  ;;  'org
  ;  (setq org-agenda-files "/Users/bmd/.config/notes/"))



;; (require 'yafolding)



(spacemacs/set-leader-keys
  "oa" 'org-agenda
  "og" 'helm-org-agenda-files-headings
  "oi" 'org-clock-in
  "oo" 'org-clock-out
  "oc" 'org-capture
  "oC" 'helm-org-capture-templates ;requires templates to be defined.
  "ol" 'org-store-link
  "ot" 'org-toggle-checkbox
  "ov" 'cider-eval-defun-to-comment
  "ow" 'add-work-entry
  "ox" 'add-extended-work-entry
  "mse" 'ruby-send-last-sexp
  "oz" 'find-gtd

  "of" 'yafolding-toggle-element

  "hw" 'sdcv-search-input
  )

(defun add-work-entry ()
  "add work journal entry"
  (interactive)
  (org-capture nil "w")
  (evil-append 1))

(defun add-extended-work-entry ()
  "add extended journal entry"
  (interactive)
  (org-capture nil "x")
  (evil-append 1))

(defun find-gtd ()
  (interactive)
  (find-file "~/drop/notes/gtd.org"))

; Set default column view headings: Task Total-Time Time-Stamp
(setq org-columns-default-format "%50ITEM(Task) %10CLOCKSUM %16TIMESTAMP_IA")
#+END_SRC

#+RESULTS:
: %50ITEM(Task) %10CLOCKSUM %16TIMESTAMP_IA

